In [1]:
import pandas as pd
import numpy as np

# 5.1 pandas的数据结构介绍

## Series

In [ ]:
obj = pd.Series([4, 7, -5, 3])
obj

In [ ]:
obj.values  # 查看值属性

In [ ]:
obj.index  # 查看位置索引属性

In [ ]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])  # 设置索引（index）
obj2

In [ ]:
obj2['a']              # 通过索引选择单一值
obj2[['c', 'a', 'd']]  # 通过索引选择多个值
obj2['d'] = 6          # 赋值

In [ ]:
obj2[obj2 > 0]  # 布尔过滤

In [ ]:
obj2 * 2  # 运算

In [ ]:
np.exp(obj2)  # 应用数学函数

In [ ]:
'b' in obj2  # 查看是否包含指定索引，Service 也是一个定长的有序字典

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)  # 通过字典创建 Service
obj3

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)  # 传入排序好的字典键，注意：obj4 中 'California' 为 NaN、 'Utah' 被丢弃
obj4

In [ ]:
pd.isnull(obj4)  # 检测是否为 NaN

In [ ]:
pd.notnull(obj4)  # 检测是否不是 NaN

In [ ]:
obj4.isnull()  # Series 的检测是否为 NaN

In [ ]:
obj3 + obj4  # Service 可以自动对齐然后运算

In [ ]:
# Service 的 name 属性
obj4.name = 'population'
obj4.index.name = 'state'
obj4

In [ ]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']  # index 可以直接通过赋值设置
obj

In [ ]:
obj.index = ['abc', 'Steve', 'Jeff', 'Ryan']  # 修改 index
obj.index[0]

## DataFrame

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)  # 通过字典创建 DataFrame
frame

In [ ]:
frame.head()  # 预览，默认前 5 行

In [ ]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])  # 指定列（columns）顺序

In [ ]:
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four','five', 'six'])  # 传入的 columns 在数据中找不到则为 NaN
frame2

In [ ]:
# 下面两种方式都可以选择列
frame2['state']  # 字典标记（适用于任何列名，建议使用）
frame2.state     # 查看属性（列名是一个合理的 Python 变量名时才适用）

In [ ]:
frame2[['year', 'state']]  # 选择多列

In [ ]:
frame2['debt'] = 16.5  # 赋标量值
frame2

In [ ]:
frame2['debt'] = range(6)  # 赋一组值
frame2

In [ ]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])  # 用 Service 赋值则会精确匹配 index，空值为 NaN
frame2['debt'] = val
frame2

In [ ]:
frame2['eastern'] = frame2.state == 'Ohio'  # 为不存在的列赋值会创建新列，注意：不能用 frame2.eastern 创建新列
frame2

In [ ]:
del frame2['eastern']  # 使用 del 删除列
frame2

In [ ]:
frame3 = frame2.copy()  # copy() 函数可以值传递
frame3['year'] = 0
frame2

In [3]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)  # 通过嵌套字典创建 DataFrame
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [ ]:
frame3.T  # 转置

In [ ]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)  # 通过 Series 组成的字典创建 DataFrame

In [ ]:
# DataFrame 设置 name 属性
frame3.index.name = 'year'
frame3.columns.name = 'state' 
frame3

In [ ]:
frame3.index

In [ ]:
frame3.columns

In [ ]:
frame3.values  # DataFrame 以二维数组的方式返回数据

In [ ]:
frame2.values  # DataFrame 会兼容所有列的数据类型

## 索引对象

In [2]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
print(index)
print(index[1:])

Index(['a', 'b', 'c'], dtype='object')
Index(['b', 'c'], dtype='object')

In [4]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [5]:
'Ohio' in frame3.columns  # columns 是否包含指定值

True

In [6]:
2003 in frame3.index   # index 是否包含指定值

False

In [7]:
frame3.index = [200, 200, 202]  # DataFrame 的 index 属性可以整体更改，可以有重复项
frame3

     Nevada  Ohio
200     NaN   1.5
200     2.4   1.7
202     2.9   3.6

In [10]:
frame3.loc[200]  # 选择重复的标签，会显示所有结果

     Nevada  Ohio
200     NaN   1.5
200     2.4   1.7

# 5.2 基本功能

## 重新索引

In [11]:
obj= pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [13]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])  # reindex() 修改 Serie 索引
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [14]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')  # ffill 向前值填充，也就是取前一个值

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [15]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [20]:
frame2 = frame.reindex(index=['a', 'b', 'c', 'd'], 
                       columns=['Texas', 'Utah', 'California'])  # reindex() 修改 DataFrame 索引
frame2

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

## 丢弃指定轴上的项

In [21]:
obj = pd.Series(np.arange(5.),
               index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [23]:
new_obj = obj.drop(['d', 'c']) # drop() 丢弃 Serie 指定值
new_obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [25]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data.drop(['Colorado', 'Ohio'])  # drop() 丢弃 DataFrame 指定值（丢弃行）

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
data.drop('one', axis='columns')  # drop() 丢弃 DataFrame 指定值（丢弃列）

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

## 索引、选取和过滤

In [2]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [3]:
obj['b']

1.0

In [4]:
obj[1]

1.0

In [5]:
obj[1:4]

b    1.0
c    2.0
d    3.0
dtype: float64

In [6]:
obj[['b', 'c', 'd']]

b    1.0
c    2.0
d    3.0
dtype: float64

In [9]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [8]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [11]:
obj['b':'d'] = 5
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [12]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [13]:
data['two']  # 选择列

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [16]:
data[['three', 'one']]  # 选择多列

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [19]:
data[:2]  # 选择行

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [21]:
data[data['three'] > 5]  # 布尔条件选择

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 用 loc 和 iloc 进行选取

In [28]:
data.loc['Colorado', ['two', 'three']]  # loc（location） 轴标签

two      5
three    6
Name: Colorado, dtype: int32

In [29]:
data.iloc[1, [1, 2]]  # iloc（int location） 整数索引

two      5
three    6
Name: Colorado, dtype: int32

In [30]:
data.loc[:'Utah', 'two']  # loc 切片(包含末尾)

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [31]:
data.iloc[:3, 1]  # iloc 切片（不包含末尾）

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

## 整数索引

In [43]:
ser = pd.Series(np.arange(3.))  # 采用整数索引会产生歧义
ser[-1]

In [37]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])  # 设置 index 可消除歧义
ser2[-1]

2.0

In [41]:
ser.iloc[-1]  # 使用 iloc 或 loc ，明确整数索引或标签索引可以消除歧义

2.0

In [44]:
ser.loc[2]

2.0

## 算术运算和数据对齐

In [45]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [46]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [47]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado']) 
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [48]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [49]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [50]:
df1 + df2  # 由于两个 DataFrame 完全没有共同的列或行，所以结果全部为 NaN

    A   B
0 NaN NaN
1 NaN NaN

## 在算术方法中填充值

In [53]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.NaN

In [54]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [55]:
df1.add(df2, fill_value=0)  # add() 相加，fill_value 属性空值用 0 代替

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [57]:
df1.sub(df2, fill_value=0)  # sub() 相减

      a     b     c     d     e
0   0.0   0.0   0.0   0.0  -4.0
1  -1.0   5.0  -1.0  -1.0  -9.0
2  -2.0  -2.0  -2.0  -2.0 -14.0
3 -15.0 -16.0 -17.0 -18.0 -19.0

In [58]:
df1.div(df2, fill_value=0)  # div() 相除（/）

     a         b         c         d    e
0  NaN  1.000000  1.000000  1.000000  0.0
1  0.8       inf  0.857143  0.875000  0.0
2  0.8  0.818182  0.833333  0.846154  0.0
3  0.0  0.000000  0.000000  0.000000  0.0

In [59]:
df1.floordiv(df2, fill_value=0)  # floordiv() 底除（整除 //）

     a    b    c    d    e
0  NaN  1.0  1.0  1.0 -0.0
1  0.0  NaN  0.0  0.0 -0.0
2  0.0  0.0  0.0  0.0 -0.0
3 -0.0 -0.0 -0.0 -0.0 -0.0

In [63]:
df1.mul(df2, fill_value=0)  # mul() 相乘（*）

      a     b      c      d    e
0   0.0   1.0    4.0    9.0  0.0
1  20.0   0.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [64]:
df1.pow(df2, fill_value=0)  # pow() 指数（**）

              a             b             c             d    e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01  0.0
1  1.024000e+03  1.000000e+00  2.799360e+05  5.764801e+06  0.0
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13  0.0
3  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.0

In [65]:
df1.reindex(columns=df2.columns, fill_value=0)  # 修改索引时也可指定填充值

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## DataFrame和Series之间的运算

In [68]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [67]:
arr - arr[0]  # 广播（行）

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [69]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [70]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [71]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [72]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [73]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [76]:
frame.sub(series3, axis='index')  # 想广播列就需要用算数运算方法，并制定行或列

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [77]:
frame-series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

## 函数应用和映射